target/test-classes/xml/sws/maintainpayment/TC32663_request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
    <soapenv:Header/>
    <soapenv:Body>
        <sel:maintainPaymentRequest>
            <sel:externalSystemID>NETCALL</sel:externalSystemID>
            <sel:action>ADHOC_PAYMENT</sel:action>
            <sel:accountNumber>$accountNumber$</sel:accountNumber>
            <sel:amount>10.00</sel:amount>
            <sel:subscriptionNumber>$subscriptionNumber$</sel:subscriptionNumber>
            <sel:cardDetails>
                <sel:useExistingCard>true</sel:useExistingCard>
            </sel:cardDetails>
        </sel:maintainPaymentRequest>
    </soapenv:Body>
</soapenv:Envelope>